### Create a data frame with 4 columns 4 rows

In [9]:
import pandas as p
s={'a':[1,2,3,4],'b':[4,5,6,7],'c':[8,9,10,11],'d':[12,13,14,15]}
k=p.DataFrame(s)
k

   a  b   c   d
0  1  4   8  12
1  2  5   9  13
2  3  6  10  14
3  4  7  11  15

### print all Columns form your data frame

In [10]:
k.loc[0:]

   a  b   c   d
0  1  4   8  12
1  2  5   9  13
2  3  6  10  14
3  4  7  11  15

### print all rows from your data frame

In [11]:
k.loc[0:]

   a  b   c   d
0  1  4   8  12
1  2  5   9  13
2  3  6  10  14
3  4  7  11  15

### print Second  column in your data frame

In [12]:
k.loc[:,'b':'b']

   b
0  4
1  5
2  6
3  7

### print last 2 columns from your data Frame

In [13]:
k.loc[:,'c':'d']

    c   d
0   8  12
1   9  13
2  10  14
3  11  15

### print  fourth row from your data Frame

In [14]:
k.loc[3:3]

   a  b   c   d
3  4  7  11  15

### print first 2  Rows from your data Frame

In [15]:
k.loc[0:1,]

   a  b  c   d
0  1  4  8  12
1  2  5  9  13

### print all rows and first 2 columns from your data Frame

In [16]:
k.loc[:,'a':'b']

   a  b
0  1  4
1  2  5
2  3  6
3  4  7

### Delete any row from your data Frame

In [17]:
k.drop(3)

   a  b   c   d
0  1  4   8  12
1  2  5   9  13
2  3  6  10  14

### Delete any column from your data Frame

In [18]:
k.pop('d')

0    12
1    13
2    14
3    15
Name: d, dtype: int64

### Add a column to a Data Frame

In [20]:
add=k.assign(e=[56,86,77,45])
k=add
k

   a  b   c   e
0  1  4   8  56
1  2  5   9  86
2  3  6  10  77
3  4  7  11  45

### Add a Row to Data Frame

In [29]:
k

   a  b   c   e
0  1  4   8  56
1  2  5   9  86
2  3  6  10  77
3  4  7  11  45

### Iterate all Columns  in your Data Frame and print result

In [39]:
for i in k:
    print(i)

a
b
c
e

### Iterate all Rows  in your Data Frame and print result.

In [38]:
for i in k.iterrows():
    print(i)

(0, a     1
b     4
c     8
e    56
Name: 0, dtype: int64)
(1, a     2
b     5
c     9
e    86
Name: 1, dtype: int64)
(2, a     3
b     6
c    10
e    77
Name: 2, dtype: int64)
(3, a     4
b     7
c    11
e    45
Name: 3, dtype: int64)

### Read income .csv  file and print as Data Frame

In [47]:
s="income.csv"
d=p.read_csv(s)
d

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

### Delete a 2006 column from your dataFrame by using drop

In [54]:
#to remove column u have to use axis as 1 and for row axis=0
d.drop(columns=["2006"],axis=1)

,GEOID,State,2005,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55734,57014,56134,54283,53367,57020,57528